Not sure if installing apps from files previously downloaded from Splunkbase applies to this case, but the same happens to me.  

```terraform 
terraform {
  required_providers {
    splunk = {
      source = "splunk/splunk"
      version = "1.4.12"
    }
  }
  required_version = "1.2.9"
}

resource "splunk_apps_local" "splunk_dashboard_examples" {
  name = "${path.module}/apps/splunk_dashboard_examples/splunk-dashboard-examples_825.tgz"
  filename = true
  explicit_appname = "Splunk_Dashboard_Examples"
}
```
When applying I get:
```bash
❯ terraform apply 
splunk_global_http_event_collector.http: Refreshing state... [id=http]
splunk_inputs_tcp_splunk_tcp_token.tcp_splunk_tcp_token: Refreshing state... [id=new-splunk-tcp-token]
splunk_inputs_tcp_cooked.tcp_cooked: Refreshing state... [id=5000]
splunk_inputs_tcp_raw.tcp_raw: Refreshing state... [id=5001]
splunk_indexes.test_index_01: Refreshing state... [id=test-index-01]
splunk_saved_searches.test_alert_presets_search: Refreshing state... [id=tfsplunk-alert-with-presets]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # splunk_apps_local.splunk_dashboard_examples will be created
  + resource "splunk_apps_local" "splunk_dashboard_examples" {
      + author           = (known after apply)
      + configured       = (known after apply)
      + description      = (known after apply)
      + explicit_appname = "Splunk_Dashboard_Examples"
      + filename         = true
      + id               = (known after apply)
      + label            = (known after apply)
      + name             = "./apps/splunk_dashboard_examples/splunk-dashboard-examples_825.tgz"
      + version          = (known after apply)
      + visible          = (known after apply)

      + acl {
          + app              = (known after apply)
          + can_change_perms = (known after apply)
          + can_share_app    = (known after apply)
          + can_share_global = (known after apply)
          + can_share_user   = (known after apply)
          + can_write        = (known after apply)
          + owner            = (known after apply)
          + read             = (known after apply)
          + removable        = (known after apply)
          + sharing          = (known after apply)
          + write            = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

splunk_apps_local.splunk_dashboard_examples: Creating...
╷
│ Error: Unable to find resource: Splunk_Dashboard_Examples
│ 
│   with splunk_apps_local.splunk_dashboard_examples,
│   on main.tf line 114, in resource "splunk_apps_local" "splunk_dashboard_examples":
│  114: resource "splunk_apps_local" "splunk_dashboard_examples" {
│ 
╵
```
The server in an EC2 instance created from a Splunk AMI 9.0.0.   
The logs show: 
```shell
- tfsplunk [14/Oct/2022:17:14:07.613 +0000] "POST /services/auth/login?count=-1&output_mode=json HTTP/1.1" 200 150 "-" "splunk-simple-go-client" - - - 5ms
- tfsplunk [14/Oct/2022:17:14:07.689 +0000] "POST /servicesNS/nobody/system/apps/local?count=-1&output_mode=json HTTP/1.1" 500 246 "-" "splunk-simple-go-client" - - - 0ms
- tfsplunk [14/Oct/2022:17:14:07.961 +0000] "GET /servicesNS/-/-/apps/local?count=-1&output_mode=json HTTP/1.1" 200 3289 "-" "splunk-simple-go-client" - - - 2ms

```


